#pragma once
#include <conio.h>
#include <stdio.h> 
#include <windows.h>

#include "model.h"
#include "global.h"
#include "game_file.h"

///////////////////////////////////////////////////////
// 函数声明

void gotoxy(int, int);

/****************************************************
[函数名称] initStatus
[函数功能] 初始化棋盘
[函数参数] 无
[返 回 值] 无
****************************************************/
void InitStatus();

/****************************************************
[函数名称] GetStatus
[函数功能] 获取坐标值
[函数参数] 横坐标与纵坐标
[返 回 值] 返回该坐标的状态
****************************************************/
int GetStatus(const Point);

/****************************************************
[函数名称] SetStatus
[函数功能] 获得用户输入的坐标、解析坐标点、设置坐标点
[函数参数] 横坐标、纵坐标与待修改的状态值
[返 回 值] 无
****************************************************/
void SetStatus(const Point);

/****************************************************
[函数名称] inputPoint
[函数功能] 获得用户输入的坐标、解析坐标点、设置坐标点
[函数参数] 横坐标、纵坐标与待修改的状态值
[返 回 值] 无
****************************************************/
void InputPoint(Point*);

/****************************************************
[函数名称] CoverTarget
[函数功能] 移动过某单元格时，恢复其原有状态
[函数参数] 单元格的状态
[返 回 值] 无
****************************************************/
void CoverTarget(const int);

/****************************************************
[函数名称] inputCoord
[函数功能] 通过方向键获得落子坐标
[函数参数] 横坐标、纵坐标与待修改的状态值
[返 回 值] int：0 玩家选择退出Y -1：玩家选择退出N
****************************************************/
int InputCoord(Point*);

/****************************************************
[函数名称] PrintPrompt
[函数功能] 输出保存提示
[函数参数] 无
[返 回 值] int：判断是否保存
****************************************************/
int PrintPrompt();

/****************************************************
[函数名称] PrintStartPrompt
[函数功能] 输出开始提示
[函数参数] 无
[返 回 值] 无
****************************************************/
void PrintStartPrompt();

/****************************************************
[函数名称] printChess
[函数功能] 输出棋盘
[函数参数] 无
[返 回 值] 无
****************************************************/
void PrintChess();

/****************************************************
[函数名称] JudgeDraw
[函数功能] 判断是否和棋
[函数参数] 无
[返 回 值] int :TRUE(1) 表示和棋 
				FALSE(0)表示可以继续
****************************************************/
int JudgeDraw();

/****************************************************
[函数名称] JudgeGame
[函数功能] 判断输赢
[函数参数] const Point :
[返 回 值] int : JUDGE_WIN 某一方胜利，游戏结束
				 JUDGE_DRAW 棋盘已满，和局
				 JUDGE_CONTINUE 没有结束，游戏继续
****************************************************/
int JudgeGame(Point point);
int JudgeHorizontal(const Point point);
int JudgeVertical(const Point point);
int JudgeHyperphoria(const Point point);
int JudgeHypophoria(const Point point);


/****************************************************
[函数名称] PrintWinner
[函数功能] 输出获胜信息
[函数参数] const int : 胜利一方信息
[返 回 值] void
****************************************************/
void PrintWinner(const Point point);

/****************************************************
[函数名称] PrintDraw
[函数功能] 输出和棋信息
[函数参数] 无
[返 回 值] void
****************************************************/
void PrintDraw();

/****************************************************
[函数名称] SaveGame
[函数功能] 保存游戏信息
[函数参数] int：nStep;
[返 回 值] void
****************************************************/
void SaveGame(int);

/****************************************************
[函数名称] LoadGame
[函数功能] 载入游戏信息
[函数参数] int*：nStep;
[返 回 值] void
****************************************************/
void LoadGame(int*);

///////////////////////////////////////////////////////